2025-01-11-iptables-en-openwrt.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>Iptables en openwrt</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Buscar..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">11 ene 2025</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2025-01-11-iptables-en-openwrt.html"
          >Iptables en openwrt</a
        >
      </h1>
      <p>Bloquear conexion a internet por IP o MAC con iptables.</p>
      <div id="outline-container-org9f27f6d" class="outline-2">
        <h2 id="org9f27f6d"># Editar las reglas del fierwall manualmente</h2>
        <div class="outline-text-2" id="text-org9f27f6d">
          <p>
            El archivo de configuración del firewall en <b>openwrt</b> es
            <b>/etc/config/firewall</b> entonces:
          </p>

          <div class="org-src-container">
            <pre class="src src-shell">
vi /etc/config/firewall
</pre
            >
          </div>
        </div>
        <div id="outline-container-org4fca42e" class="outline-3">
          <h3 id="org4fca42e">
            Agregar la regla para bloquear la IP del dispositivo
          </h3>
          <div class="outline-text-3" id="text-org4fca42e">
            <div class="org-src-container">
              <pre class="src src-shell">config rule
  option name <span style="color: #98be65;">'Bloquear Dispositivo'</span>
  option src <span style="color: #98be65;">'lan'</span>
  option dest <span style="color: #98be65;">'wan'</span>
  option src_ip <span style="color: #98be65;">'192.168.1.100'</span>
  option target <span style="color: #98be65;">'DROP'</span>
</pre>
            </div>

            <p>
              Cambiar <b>src<sub>ip</sub></b> por <b>src<sub>mac</sub></b> para
              bloquear por dirección mac, o para bloquear varios dispositivos en
              lugar de <b>option src ip &#x2026;</b>, debe ser
              <b>list src ip&#x2026;</b>
            </p>
          </div>
        </div>
        <div id="outline-container-orgd819460" class="outline-3">
          <h3 id="orgd819460">Reiniciar el firewall</h3>
          <div class="outline-text-3" id="text-orgd819460">
            <p>Aplicar los cambios reiniciando el servicio del firewall:</p>

            <div class="org-src-container">
              <pre class="src src-shell">
/etc/init.d/firewall restart
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org6956154" class="outline-3">
          <h3 id="org6956154">Verificar regla aplicada</h3>
          <div class="outline-text-3" id="text-org6956154">
            <div class="org-src-container">
              <pre class="src src-shell">
iptables -L -v
</pre
              >
            </div>

            <p>
              Buscar una regla que contenga la IP del dispositivo y confirme que
              está bloqueda.
            </p>
          </div>
        </div>
      </div>
      <div id="outline-container-org45b8305" class="outline-2">
        <h2 id="org45b8305">
          # Habilitar y deshabilitar la regla en un horario especifico
          utilizando <b>cron</b>
        </h2>
        <div class="outline-text-2" id="text-org45b8305"></div>
        <div id="outline-container-orgd1c9d86" class="outline-3">
          <h3 id="orgd1c9d86">
            Crear scripts para habilitar y deshabilitar la regla
          </h3>
          <div class="outline-text-3" id="text-orgd1c9d86"></div>
          <div id="outline-container-orgcc64342" class="outline-4">
            <h4 id="orgcc64342">Script para habilitar la regla:</h4>
            <div class="outline-text-4" id="text-orgcc64342">
              <div class="org-src-container">
                <pre class="src src-shell">
vi /etc/firewall.enable_block.sh   
</pre
                >
              </div>

              <p>Contenido del script:</p>

              <div class="org-src-container">
                <pre
                  class="src src-shell"
                ><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/</span><span style="color: #51afef;">sh</span><span style="color: #5B6268;">
</span>uci set firewall.@rule[&lt;&#237;ndice&gt;].enabled=<span style="color: #98be65;">'1'</span>
uci commit firewall
/etc/init.d/firewall restart
</pre>
              </div>

              <p>
                Cambiar <b>&lt;índice&gt;</b> por el índice de la regla en el
                archivo <b>/etc/config/firewall</b>. Usar:
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-shell"
                >uci show firewall | grep <span style="color: #98be65;">'Bloquear Dispositivo'</span>
</pre>
              </div>

              <p>
                para identificarlo. Ejemplo: si hay algo como firewall.@rule[4],
                entonces &lt;índice&gt; será 4.
              </p>
            </div>
          </div>
          <div id="outline-container-org7cbcbf2" class="outline-4">
            <h4 id="org7cbcbf2">Script para deshabilitar la regla</h4>
            <div class="outline-text-4" id="text-org7cbcbf2">
              <div class="org-src-container">
                <pre class="src src-shell">
vi /etc/firewall.disable_block.sh
</pre
                >
              </div>

              <p>Contenido del script:</p>

              <div class="org-src-container">
                <pre
                  class="src src-shell"
                ><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/</span><span style="color: #51afef;">sh</span><span style="color: #5B6268;">
</span>uci set firewall.@rule[&lt;&#237;ndice&gt;].enabled=<span style="color: #98be65;">'0'</span>
uci commit firewall
/etc/init.d/firewall restart
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-orgda37ce8" class="outline-4">
            <h4 id="orgda37ce8">Scripts ejecutables:</h4>
            <div class="outline-text-4" id="text-orgda37ce8">
              <div class="org-src-container">
                <pre class="src src-shell">
chmod +x /etc/firewall.enable_block.sh /etc/firewall.disable_block.sh
</pre
                >
              </div>
            </div>
          </div>
        </div>
        <div id="outline-container-orgf25ecec" class="outline-3">
          <h3 id="orgf25ecec">Programar las tares con cron</h3>
          <div class="outline-text-3" id="text-orgf25ecec">
            <div class="org-src-container">
              <pre class="src src-shell">
crontaba -e
</pre
              >
            </div>

            <p>
              Agregar las siguientes líneas para habilitar y deshabilitar la
              regla a horarios especificos:
            </p>

            <div class="org-src-container">
              <pre
                class="src src-shell"
              ><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Habilitar la regla todos los d&#237;as a las 8:00 AM
</span>0 2 * * * /etc/firewall.enable_block.sh


<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Deshabilitar la regla todos los d&#237;as a las 8:00 PM
</span>0 7 * * * /etc/firewall.disable_block.sh
</pre>
            </div>

            <p>Reiniciar cron</p>

            <div class="org-src-container">
              <pre class="src src-shell">
/etc/init.d/cron restart
</pre
              >
            </div>

            <p>Ver logs de cron</p>

            <div class="org-src-container">
              <pre class="src src-shell">
logread | grep cron
</pre
              >
            </div>
          </div>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-openwrt.html">openwrt</a>
        <a href="https://martiyo.github.io/tag-linux.html">linux</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
